<?php
//会员类型
$config->user_type_option = array(
	'1' => '超级管理员',
	'2' => '网站管理员',
	'3' => '中介公司',
	'4' => '开发商',
	'5' => '银行',
	'6' => '担保公司',
	'7' => '监督机构',
	'8' => '代理公司',
	'9' => '经纪人',
	'10'=> '市民'
);

//房产媒体
$config->house_media_option = array(
	'1'=>'搜房网',
	'2'=>'腾讯·大成网',
	'3'=>'新浪房产（百度乐居）',
	'4'=>'焦点房产网',
	'5'=>'好房100网',
	'6'=>'透明房产网',
	'7'=>'腾讯·蓝房网'
);
//信息来源 1:报纸 2:网络 3:电话 4:调查 5:其他
$config->dynamic_from_option = array(
	'0'=>'其他',
	'1'=>'报纸',
	'2'=>'网络',
	'3'=>'电话',
	'4'=>'调查',
	'5'=>'官方'
);
//信息类型[1:普通 2:优惠]
$config->dynamic_type_option = array(
	'0'=>'其他',
	'1'=>'动态',
	'2'=>'优惠'
);
//楼盘评论信息分类
$config->comment_type_option = array(
		'1'=>'综合',
		'2'=>'地段交通',
		'3'=>'生活配套',
		'4'=>'物业',
		'5'=>'户型',
		'6'=>'开发商',
		'7'=>'价格',
		'8'=>'装修'
);

//项目、小区评级
$config->rating_level_option = array(
		"0"=>"1",
		"1"=>"2",
		"2"=>"3",
		"3"=>"4",
		"4"=>"5"
);

//客户预定类型
$config->reserve_type_option = array(
	'1' =>'预约看房',
	'2' =>'组团看房',
	'3' =>'订阅',
	'4' =>'专家咨询',
	'5' =>'贷款'
);

//订阅、类型
$config->reserve_subtype_option = array(
	'1' =>'变价通知',
	'2' =>'优惠通知',
	'3' =>'开盘通知',
	'4' =>'最新动态',
	'5' =>'看房团通知'
);

//举报类型
$config->report_type_option = array(
    '1' =>'房子不存在或已经卖了',
    '2' =>'图文与实际不符',
    '3' =>'价格与实际不符',
    '4' =>'其他'
);

//问题类别
$config->faq_type_option = array(
	'1' =>'购房',
	'2' =>'代办',
	'3' =>'出售',
	'4' =>'专家咨询',
	'5'=>'不动产购买',
	'6'=>'不动产管理'
);

//图片类型
$config->pic_option = array(
		//'21001'=>'户型图',
		'21002'=>'效果图',
		'21003'=>'工程进度图',
		'21004'=>'平面图',
		'21005'=>'样板间',
		'21006'=>'宣传图',
		'21007'=>'交通图',
		'21008'=>'展位图',
		'21009'=>'LOGO'
	);

//置顶(3置顶首页2置顶新房首页1随机)
$config->digest_option = array(
	"1"=>"随机",
	"2"=>"新房",
	"3"=>"首页"
);

//状态标志[0:无效 1:有效]
$config->flag_option = array(
	"0"=>"无效",
	"1"=>"有效"
);
$config->map_show_option = array(
	"0"=>"不显示",
	"1"=>"显示"
);



//逻辑状态[0:否 1:是]
$config->boole_option = array(
	"0"=>"否",
	"1"=>"是"
);

//有无状态[0:有 1:无]
$config->have_option = array(
	"0"=>"无",
	"1"=>"有"
);

//价格状态[0:历史 1:最新]
$config->price_status_option = array(
	"0"=>"历史",
	"1"=>"最新"
);

//发布状态[0:未发布 1:已发布]
$config->ifpub_option = array(
	"0"=>"未发布",
	"1"=>"已发布"
);

/*************  项目物理属性  **************/
//物业类型
$config->pm_type_option = array(
	'0' => '不限',
    '22308' => '住宅',
    '22301' => '别墅',
    '22309' => '商住',
    '22304' => '商铺',
    '22305' => '写字楼',
    //'22302' => '多层',
    //'22303' => '电梯',
    //'22306' => '经济适用房',
    //'22307' => '限价房',
	'22311' => '酒店式公寓',
	'22310' => '其他'
	);

//住宅使用特征
$config->use_feature_option = array(
	"0"=>"不限",
	"1"=>"刚需房",
	"2"=>"低首付",
	"3"=>"低总价",
	"4"=>"品牌开发商",
	"5"=>"二至三环",
	"6"=>"使用面积多"
);

//装修类型
$config->fitmen_type_option = array(
	'0'=>'待定',
	'1'=>'毛坯',
	'2'=>'精装'
);

//项目状态(1在售2未开盘3售罄),该只是自定义的和code_base中的不对应，存放在主表中
$config->status_option = array(
	'0'=>'待定',
	'1'=>'在售',
	'2'=>'预告',
	'3'=>'售罄'
);

//项目工程进度(1未开工2在建3封顶)
$config->plan_option = array(
	'0'=>'待定',
	'1'=>'未开工',
	'2'=>'在建',
	'3'=>'封顶'
);

//住在项目建筑类型=跃层、复式、联排、双拼、叠拼
$config->build_type_option = array(
	'0'=>'待定',
	'1' =>'平层',
	'2' =>'跃层',
	'3' =>'复式',
	'4' =>'联排',
	'5' =>'双拼',
	'6' =>'叠拼'
);

//建筑形态(1多层2小高层3高层4别墅5混合)
$config->structure_option = array(
	"1"=>"多层",
	"2"=>"小高层",
	"3"=>"高层",
	"4"=>"别墅",
	"5"=>"混合"
);

//项目属性(1学区、2地铁、3投资、4养老)
$config->attribute_option = array(
	"1"=>"学区",
	"2"=>"地铁",
	"3"=>"投资",
	"4"=>"养老"
);

//项目定位（1刚需2改需3高端4投资5豪宅）
$config->level_option = array(
	'1' =>'刚需',
	'2' =>'改需',
	'3' =>'高端',
	'4' =>'投资',
	'5' =>'豪宅'
);

/**************  项目区域属性  *****************/
//方位
$config->direction_option = array(
    '0' => '待定',
	'20501' => '东',
    '20502' => '南',
    '20503' => '西',
    '20504' => '北',
    '20509' => '中'
);

//片区region

//行政区域
$config->borough_option = array(
		'0'		=>'不限',
		'510104'=>'锦江区',
		'510105'=>'青羊区',
		'510106'=>'金牛区',
		'510107'=>'武侯区',
		'510108'=>'成华区',
		'510109'=>'高新区',
		'510112'=>'龙泉',
		'510113'=>'青白江',
		'510121'=>'金堂',
		'510122'=>'双流',
		'510123'=>'温江',
		'510124'=>'郫县',
		'510125'=>'新都',
		'510129'=>'大邑',
		'510131'=>'蒲江',
		'510132'=>'新津',
		'510181'=>'都江堰',
		'510182'=>'彭州',
		'510183'=>'邛崃',
		'510184'=>'崇州'
	);

//区域环线
$config->circle_option = array(
	'0' => '待定',
    '21101' => '一环路以内',
    '21102' => '一环路~二环路',
    '21103' => '二环路~三环路',
    '21104' => '三环路~绕城',
    '21105' => '绕城外'
);
//位置区域(1市区，2郊县，3其他)
$config->district_option = array(
	'0' => '待定',
    '1' => '市区',
    '2' => '郊县',
    '3' => '其他'
);
//地铁
$config->tube_option = array(
	'0' => '待定',
	'1' => '一号线',
	'2' => '二号线',
	'3' => '三号线',
	'4' => '四号线',
	'5' => '五号线',
	'6' => '六号线'
);


/********** 价格、户型、面积参数 *************/
//价格
$config->price_option = array(
	'0-5000' => '不限',
	'5000-6000' => '5000-6000元',
	'6000-7000' => '6000-7000元',
	'7000-8000' => '7000-8000元',
	'8000-9000' => '8000-9000元',
	'9000-0' => '9000以上',
);

//面积
$config->area_option = array(
	'0' => '不限',
	'0-50' => '50平米以下',
	'50-80' => '50-80平米',
	'80-100' => '80-100平米',
	'100-150' => '100-150平米',
	'150-200' => '150-200平米',
	'200-0' => '200平米以上',
);

//户型套型 

$config->apa_room_option = array(
	'0' => '不限',
	'1' => '一室',
	'2' => '两室',
	'3' => '三室',
	'4' => '四室',
	'5' => '五室以上',
);

//厅 名字和数据库一致
$config->ting_option = array(
	'0' => '不限',
	'1' => '一厅',
	'2' => '两厅',
	'3' => '三厅',
	'4' => '三厅以上',

);
//卫
$config->wei_option = array(
	'0' => '不限',
	'1' => '一卫',
	'2' => '两卫',
	'3' => '两卫以上',
);
$config->porch_option = array(
	'0' => '不限',
	'1' => '一个',
	'2' => '两个',
	'3' => '两个以上',
);






/************** 特征描述 ************/
//特征点大类
$config->feature_maintype = array(
		"0"=>"城际交通枢纽",
		"1"=>"城市交通",
		"2"=>"景观资源",
		"3"=>"商业",
		"4"=>"基础教育",
		"5"=>"医疗",
		"6"=>"娱乐"
);

//特征点小类
$config->feature_type = array(
		"0"=>array(
			"0"=>"飞机场",
			"1"=>"火车客站",
			"2"=>"汽车客运站"
			),
		"1"=>array(
			"0"=>"地铁站"
			),
		"2"=>array(
			"0"=>"自然景观",
			"1"=>"文化遗迹",
			"2"=>"主题景观",
			"3"=>"市政绿地",
			"4"=>"项目绿化"
			),
		"3"=>array(
			"0"=>"商业街",
			"1"=>"综合体",
			"2"=>"商场"
			),
		"4"=>array(
			"0"=>"幼儿园",
			"1"=>"小学",
			"2"=>"中学",
			"3"=>"图书馆"
			),
		"5"=>array(
			"0"=>"二甲以上医院",
			"1"=>"社区医院"
		),
		"6"=>array(
			"0"=>"电影院",
			"1"=>"KTV",
			"2"=>"酒吧、迪吧"
		)
);

//特征级别
$config->feature_level = array(
	"1"=>"1",
	"2"=>"2",
	"3"=>"3",
	"4"=>"4",
	"5"=>"5"
);

/*********** 智能房屋配置 *************/
//小区景观
$config->view_liv_option = array(
	'1' =>'项目中庭',
	'2' =>'组团绿化',
	'3' =>'一般绿化',
	'4'=>'公园绿地',
	'5' =>'无'
);
//住宅类型(户型类型)
$config->apa_type_option = array(
	'1' =>'平层',
	'2' =>'错层',
	'3' =>'跃层',
	'4' =>'复式'
);
//房间大小
$config->room_size_option = array(
	'2' =>'标准',
	'1' =>'宽大',
	'3' =>'紧凑'
);

/*********** 二手房配置 *************/
//二手房物业类型
$config->property_option = array(
	'0' =>'不限',
	'20301' =>'普通住宅',
	'20303' =>'别墅',
	'20306' =>'写字楼',
	'20314' =>'商业',
	'20313' =>'其它'
);

//内部装修
$config->fitment_option = array(
	'0'=>'不限',
	'21901'=>'尚未装修',
	'21902'=>'普通装修',
	'21903'=>'中档装修',
	'21904'=>'高档装修'
);

//年代
$config->year_option = array(
	'0' => '不限',
	'0-1980' => '80年代以前',
	'1980-1990' => '80-90年代',
	'1990-2000' => '90-00年代',
	'2000-2010' => '00-10年代',
	'2010-0' => '2010年以后',
);
//租赁方式
$config->rent_way_option=array(
	"0"=>"不限",
	"1"=>"整租",
	"2"=>"合租"
);
//产权性质
$config->pright_option=array(
	"21601" => "个人产权",
	"21602" => "单位产权", 
	"21603" => "公房",
	"21604" => "房改房",
	"21605" => "经济适用房",
	"21606" => "商品房合同", 
	"21607" => "协议房"
);
//房屋朝向
$config->orientation_option=array(
	'0' => '待定',
	'1' => '东',
    '2' => '南',
    '3' => '西',
    '4' => '北'
);

/*********** 租房配置 *************/
//最短租期
$config->time_limit_option=array(
	"0"=>"一月",
	"1"=>"一季",
	"2"=>"一年"
);

//押金方式
$config->pay_way_option=array(
	0=>"面议",
	1=>"押一付三",
	2=>"押一付一",
	3=>"押二付一",
	4=>"半年付",
	5=>"年付"
);
//房屋类别
$config->house_type_option=array(
	1=>"出租",
	2=>"出售"
);

//配套设施 -- by xiewen

$config->facilities=array(
	21701=>'水',
	21702=>"电",
	21703=>"气",
	21704=>"有线电视",
	21705=>"电话",
	21706=>"ADSL线路",
	21707=>"宽带",
	21708=>"数字电视",
	21709=>"橱柜",
	21710=>"厨房配套",
	21711=>"油烟机",
	21712=>"车位",
	21713=>"车库",
	21714=>"物业管理",
	21715=>"封闭小区",
	21717=>"电视",
	21718=>"洗衣机",
	21719=>"冰箱",
	21720=>"空调",
	21721=>"热水器",
	21722=>"床",
	21723=>"衣柜",
	21724=>"沙发",
	21725=>"茶几",
	21726=>"其他家具",
	);
//- by xiewen
$config->reserve_type=array(
	0=>"无",
	1 =>"预约看房",
	2=>"组团看房",
	3=>"订阅",
	4=>"专家咨询",
	);
//- by xiewen
$config->reserve_subtype=array(
	0=>"无",
	1 =>"变价通知",
	2=>"优惠通知",
	3=>"开盘通知",
	4=>"最新动态",
	5=>"看房团通知",
	);
$config->order_status_option=array(
	0=>"未支付",
	1=>"已支付",
	);

$config->pay_type_option=array(
	1 =>"余额支付",
	2=>"支付宝",
	3=>"微信支付",
	4=>"快钱支付",
	5=>"paypal",
	)



?>
